In [1]:
import numpy as np
import pandas as pd

In [2]:
my_dict = {"James" : [40,30,np.nan], "Kirk" : [20,np.nan,50], "Lars" : [30,50,40]}

In [3]:
my_data_frame = pd.DataFrame(my_dict)

In [4]:
my_data_frame

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [5]:
my_data_frame.dropna()  # İçinde NaN geçen satırları siler.

   James  Kirk  Lars
0   40.0  20.0    30

In [6]:
my_new_dict = {"James" : [40,30,np.nan], "Kirk" : [20,np.nan,50], "Lars" : [30,50,40], "Rob" : [45,np.nan,np.nan]}

In [7]:
my_new_data_frame = pd.DataFrame(my_new_dict)

In [8]:
my_new_data_frame

   James  Kirk  Lars   Rob
0   40.0  20.0    30  45.0
1   30.0   NaN    50   NaN
2    NaN  50.0    40   NaN

In [10]:
#groupby

In [11]:
salary_dict = {"Programming Language" : ["Python","Java","Swift","C","R"], "Name" : ["A","B","C","D","E"],"Salary" : [100,90,80,70,60]}

In [12]:
salary_frame = pd.DataFrame(salary_dict)

In [13]:
salary_frame

  Programming Language Name  Salary
0               Python    A     100
1                 Java    B      90
2                Swift    C      80
3                    C    D      70
4                    R    E      60

In [15]:
group_object = salary_frame.groupby("Programming Language")

In [16]:
group_object.count()

                      Name  Salary
Programming Language
C                        1       1
Java                     1       1
Python                   1       1
R                        1       1
Swift                    1       1

In [17]:
group_object.mean()

C:\Users\eda-k\AppData\Local\Temp\ipykernel_6576\3749447628.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  group_object.mean()

                      Salary
Programming Language
C                       70.0
Java                    90.0
Python                 100.0
R                       60.0
Swift                   80.0

In [18]:
group_object.min("Salary")

                      Salary
Programming Language
C                         70
Java                      90
Python                   100
R                         60
Swift                     80

In [20]:
my_dict1 = {"Name" : ["A","B","C",],"Sports" : ["Basketball","Voleyboll","Tennis"], "Calories" : [100,200,300]}

In [21]:
my_frame1 = pd.DataFrame(my_dict1)

In [22]:
my_frame1

  Name      Sports  Calories
0    A  Basketball       100
1    B   Voleyboll       200
2    C      Tennis       300

In [23]:
my_dict2 = {"Name" : ["D","E","F",],"Sports" : ["Basketball","Voleyboll","Tennis"], "Calories" : [200,50,400]}

In [29]:
my_frame2 = pd.DataFrame(my_dict2)

In [30]:
my_frame2

  Name      Sports  Calories
0    D  Basketball       200
1    E   Voleyboll        50
2    F      Tennis       400

In [31]:
my_dict3 = {"Name" : ["G","H","I",],"Sports" : ["Basketball","Voleyboll","Tennis"], "Calories" : [45,30,50]}

In [32]:
my_frame3 = pd.DataFrame(my_dict3)

In [33]:
my_frame3

  Name      Sports  Calories
0    G  Basketball        45
1    H   Voleyboll        30
2    I      Tennis        50

In [34]:
#concatenation

In [35]:
pd.concat([my_frame1,my_frame2,my_frame3])

  Name      Sports  Calories
0    A  Basketball       100
1    B   Voleyboll       200
2    C      Tennis       300
0    D  Basketball       200
1    E   Voleyboll        50
2    F      Tennis       400
0    G  Basketball        45
1    H   Voleyboll        30
2    I      Tennis        50

In [36]:
#merge

In [38]:
pd.merge(my_frame1,my_frame2,on="Sports")

  Name_x      Sports  Calories_x Name_y  Calories_y
0      A  Basketball         100      D         200
1      B   Voleyboll         200      E          50
2      C      Tennis         300      F         400